app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def index
    render json: Pokemon.all

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Pokemon.find_by(id: params[:id])

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 7]]
---
  def destroy
    pokemon = Pokemon.find_by(id: params[:id])
    pokemon.destroy