app/controllers/trainers_controller.rb

  def index
    render json: Trainer.all, include: :pokemon
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 1]]
SELECT "trainers".* FROM "trainers"

  def show
    render json: Trainer.find_by(id: params[:id])
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def generate_pokemon
    name = Faker::Name.first_name
    species = Faker::Games::Pokemon.name
    pokemon = Pokemon.create(nickname: name, species: species, trainer_id: params[:trainer_id]
    )
---
INSERT INTO "pokemons" ("species", "nickname", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["species", "Krabby"], ["nickname", "Holley"], ["trainer_id", 2], ["created_at", "2020-03-27 20:05:09.965048"], ["updated_at", "2020-03-27 20:05:09.965048"]]